read_liberty -lib sky130_fd_sc_hd__tt_025C_1v80.lib
read_verilog Add_Sub_4bit.v
synth -top adder_subtractor_4bit
dfflibmap -liberty sky130_fd_sc_hd__tt_025C_1v80.lib
abc -liberty sky130_fd_sc_hd__tt_025C_1v80.lib
clean
flatten
write_verilog -noattr synth.v
tee -o report_rca.txt stat -liberty sky130_fd_sc_hd__tt_025C_1v80.lib
show -prefix ./netlist -format jpeg
